src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПоставщику/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ДатаПоставки = КонецДня(ТекущаяДатаСеанса()) + 1;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Ложь);
		КодСтроки = 1;
		Для Каждого Стр Из ДанныеЗаполнения.МасТовары Цикл
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
			НС.КодСтроки = КодСтроки;
			НС.СуммаНДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(НС.СтавкаНДС, НС.Сумма, ЦенаВключаетНДС);
			КодСтроки = КодСтроки + 1;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Документы.ЗаказПокупателя.ЗаказПроводится(ДанныеЗаполнения.ВидОперации) Тогда
			ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения);
		Иначе
			ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредложениеПоставщика") Тогда
		ЗаполнитьПоПредложениюПоставщика(ДанныеЗаполнения);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(Заказ)
	// Заказ поставщику под заказ покупателя: состав из заказа, поставщик - основной поставщик товаров
	// (если он один на все строки), цены - последний прайс поставщика.
	Организация = Заказ.Организация;
	ЦенаВключаетНДС = Истина; // цены прайса поставщиков хранятся с НДС
	МасНоменклатура = Заказ.ТЧТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	ЗаполнитьОбщегоОсновногоПоставщика(МасНоменклатура);
	ТЗЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ТекущаяДатаСеанса(), МасНоменклатура,
		?(ЗначениеЗаполнено(Контрагент), Контрагент, Неопределено));
	КодСтроки = 1;
	Для Каждого Стр Из Заказ.ТЧТовары Цикл
		НС = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр, "Номенклатура, Характеристика, Упаковка, КоличествоУпаковок, Количество, СтавкаНДС");
		НС.КодСтроки = КодСтроки;
		КодСтроки = КодСтроки + 1;
		СтрЦена = ТЗЦены.Найти(НС.Номенклатура, "Номенклатура");
		Если СтрЦена <> Неопределено Тогда
			НС.Цена = СтрЦена.Цена;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

// Заказ поставщику под заказ клиента на производство (E7): основание - заказ, строки - дефицит потребности из
// регистра, а не из текущей техкарты. Без сформированной потребности ввод отклоняется (требование 3.6).
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ клиента на производство при включённой опции.
//
Процедура ЗаполнитьПоЗаказуНаПроизводство(Заказ)
	Потребности = РегистрыНакопления.ПотребностиПроизводства;
	Если Не Потребности.ЗаказФормируетПотребность(Заказ) Тогда
		ВызватьИсключение Потребности.ТекстЗаказБезПотребности();
	КонецЕсли;
	Организация = Заказ.Организация;
	Основание = Заказ;
	ЦенаВключаетНДС = Истина; // цены прайса поставщиков хранятся с НДС
	Дефицит = Потребности.ДефицитЗаказа(Заказ);
	ЗаполнитьОбщегоОсновногоПоставщика(Дефицит.ВыгрузитьКолонку("Материал"));
	Документы.ЗаказПоставщику.ЗаполнитьПоПотребности(ТЧТовары, Дефицит, ЦенаВключаетНДС, Контрагент);
	Если Дефицит.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Потребности.ТекстПотребностьЗаказана());
	КонецЕсли;
КонецПроцедуры

// Поставщик и договор - основной поставщик номенклатуры, если он у всех позиций один.
//
// Параметры:
//  Номенклатура - Массив - ссылки на номенклатуру строк.
//
Процедура ЗаполнитьОбщегоОсновногоПоставщика(Номенклатура)
	Поставщики = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Номенклатура, "ОсновнойПоставщик");
	ОдинПоставщик = Неопределено;
	Для Каждого КлючИЗначение Из Поставщики Цикл
		Если ОдинПоставщик = Неопределено Тогда
			ОдинПоставщик = КлючИЗначение.Значение.ОсновнойПоставщик;
		ИначеЕсли ОдинПоставщик <> КлючИЗначение.Значение.ОсновнойПоставщик Тогда
			ОдинПоставщик = Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ОдинПоставщик) Тогда
		Контрагент = ОдинПоставщик;
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоПредложениюПоставщика(Предложение)
	// Заказ поставщику по выигравшему предложению тендера: поставщик, договор, состав и цены
	// из предложения, основание - заказ покупателя, по которому шёл тендер.
	// Валюта основания переносится, курс - на дату нового документа.
	РаботаСВалютами.ЗаполнитьВалютуПоОснованию(ЭтотОбъект, Предложение);
	Организация = Предложение.Организация;
	Контрагент = Предложение.Поставщик;
	Если ЗначениеЗаполнено(Предложение.Договор) Тогда
		Договор = Предложение.Договор;
	Иначе
		Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Контрагент, Организация, Ложь);
	КонецЕсли;
	Основание = Предложение.ЗаказПокупателя;
	ЦенаВключаетНДС = Предложение.ЦенаВключаетНДС;
	КодСтроки = 1;
	// Предложение по заказу на производство: строки - остатком дефицита заказа, как «Заказать у победителя» (T27);
	// по заказу продажи и без заказа - как раньше.
	Если ЗначениеЗаполнено(Предложение.ЗаказПокупателя)
		И ПроизводственныеЗаказы.ЭтоЗаказНаПроизводство(Предложение.ЗаказПокупателя) Тогда
		ДанныеПредложения = Обработки.АРМЗакупки.СтрокиПредложенияДляЗаказа(Предложение);
		Для Каждого Стр Из ДанныеПредложения.Строки Цикл
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр, "Номенклатура, Характеристика, Цена, СтавкаНДС");
			НС.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "Единица");
			НС.КоличествоУпаковок = Стр.Количество;
			НС.Количество = Стр.Количество;
			НС.КодСтроки = КодСтроки;
			КодСтроки = КодСтроки + 1;
			РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, ЦенаВключаетНДС);
		КонецЦикла;
		Если ЗначениеЗаполнено(ДанныеПредложения.Пояснение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПредложения.Пояснение);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Для Каждого Стр Из Предложение.ТЧТовары Цикл
		НС = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр, "Номенклатура, Характеристика, Упаковка, КоличествоУпаковок, Количество, Цена, СтавкаНДС");
		НС.КодСтроки = КодСтроки;
		КодСтроки = КодСтроки + 1;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Блокировки: потребности заказа клиента - до чтения их остатков
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	Блокировка.Заблокировать();
	// Закупка под заказ на производство другой организации - отказ (ревью техдолга Codex 2026-10-09, T10).
	ТекстЗапрета = РегистрыНакопления.ПотребностиПроизводства.ТекстЗапретаОрганизацииЗакупки(ЭтотОбъект);
	Если ЗначениеЗаполнено(ТекстЗапрета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстЗапрета, ЭтотОбъект, "Организация", , Отказ);
		Возврат;
	КонецЕсли;
	// Формируем движения
	РегистрыНакопления.ЗаказыПоставщикам.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ПотребностиПроизводства.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: блокировки в порядке проведения,
// очистка движений и пересчёт стадий заказов (E8). Без таких заказов движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8). Рабочие места закупок и производства берут
// тот же набор перед проверкой остатков заказа поставщику и записью документа.
//
// Параметры:
//  Блокировка - БлокировкаДанных - заполняемая блокировка.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка) Экспорт
	УправляемыеБлокировки.ПотребностиПроизводстваЗакупки(Блокировка, ЭтотОбъект);
	УправляемыеБлокировки.ЗаказыПоставщикамДокумента(Блокировка, ЭтотОбъект);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	РаботаСВалютами.ПроверитьВалютуДокумента(ЭтотОбъект, Отказ);
	РаботаСДокументами.ЗаполнитьИтогиДокумента(ЭтотОбъект);
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры
